---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MassDataPercentageGlazing
source: html/8a6f944f-7b95-7e8b-2d7c-dba92baac770.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MassDataPercentageGlazing Property

"Target Percentage Glazing"

## Syntax (C#)
```csharp
public static ForgeTypeId MassDataPercentageGlazing { get; }
```